#+TITLE: Readme
#+PROPERTY: header-args :tangle project.jl
#+STARTUP: showeverything

* Entangled Quantum Cuckoo search for multi-objective quadratic multi-knapsack problem

* TODO Project Roadmap
SCHEDULED: <2021-10-20 Wed>
- [ ] Import Data from Website
- [ ] Implement Levy Flights
- [ ] Implement quantum behavior
- [ ] Implement cuckoo search method for knapsack data
- [ ] Evaluate Performance
- [ ] Make plots and write report

* Imports
#+begin_src julia
using Distributions.jl, Chain,
#+end_src

* Levy Flights
#+begin_src julia
flight=Levy()

#+end_src

* Pareto Filtering
#+begin_src julia
function pareto_filter(x::AbstractArray)
	d,n=size(x)
	io=repeat([true],n)
	for i∈ 1:n-1, j∈ i:n
		if i!=j && (io[i] || io[j])
			xi=x[:,i]
			xj=x[:,j]
			if all(xi<= xj) && any(xi<xj)
				io[j]=false
			elseif all(xj<= xi) && any(xj<xi)
				io[i]=false
			end

		end
	end
	return(x[:,io])
end
#+end_src

* Quantum Operators
#+begin_src julia
function measure(qv)
    return map(x->rand()>abs2(qv[x][2]) ? 1 : 0, 1:size(qv)[1])
end

function interfere(qv,sol)
    pa=pi/20

    rot_mat=[cos(pa) -sin(pa); sin(pa), cos(pa)]


end

function iq_mutate(qv)

end

function eq_mutate(qv)

end
#+end_src

#+RESULTS:

* Defining Superposition Quantum Vectors
#+begin_src julia
n=50
# This creates normalized qbits who's complex probabilities sum to 1.
function ab(x)
           a=rand(x)+rand(x)*im
           b=rand(x)+rand(x)*im
           return map(y->[a[y]/sqrt(abs2(a[y])+abs2(b[y])),b[y]/sqrt(abs2(a[y])+abs2(b[y]))],1:x)
       end
qvec=
#+end_src

#+RESULTS:

* Example Julia Code
#+begin_src julia :eval no-export :results output :exports both
a=collect(1:10)
for i in 1:10
    if i%2==0
        a[i]=a[i]^2
    end
end
a
#+end_src

#+RESULTS:
#+begin_example
10-element Vector{Int64}:
  1
  2
  3
  4
  5
  6
  7
  8
  9
 10
10-element Vector{Int64}:
   1
   4
   3
  16
   5
  36
   7
  64
   9
 100
#+end_example


* References of Interest
https://www-sciencedirect-com.ezproxy.lib.purdue.edu/science/article/pii/S0957417417308217
https://www-sciencedirect-com.ezproxy.lib.purdue.edu/science/article/pii/S1568494620310152?casa_token=36zagcogZDkAAAAA:weBL0ohC_du_vqfYamDz2vdrnaovcRWkk3fmKPcNFbJEGSD8VxhgxwEcBNNrNbOLx27p4mmqNg#tbl6
https://www.researchgate.net/publication/250309677_A_Novel_Greedy_Quantum_Inspired_Cuckoo_Search_Algorithm_for_variable_sized_Bin_Packing_Problem
